

#include "RS485.h"

//*****************************************************************************/
//*函数名 :void RS485_Init(void)
//*说明   :RS485硬件初始化
//*参数   :无
//*返回值 :无
//*作者   :
//*****************************************************************************/

void RS485_Init(void)
{
    Usart2_Module_Init(9600);         // 初始化串口2    
    GPIO_Init(RS485_EN_PORT, RS485_EN_PIN, GPIO_Mode_Out_PP_High_Fast);// 配置RS485EN引脚为高速推挽输出 
    RS_EN_RX(); // 初始将RS485设置为接收模式
}

//*****************************************************************************/
//*函数名 :void RS485_Send(u8 *Arr)
//*说明   :RS485发送数据
//*参数   :*Arr   需要发送的数据
//*         Len   数据长度
//*返回值 :无
//*作者   :
//*****************************************************************************/
void RS485_Send(u8 *Arr, u8 Len)
{   
    RS_EN_TX();                         // 使能RS485发送 
    UsartSend(USART2, Arr, Len);     // 发送数据
    RS_EN_RX();                         // 使能RS485接收
}










