#include "RS485.h"


//*****************************************************************************/
//*函数名 :void RS485_Init(u16 Bound)
//*说明   :RS485初始化
//*参数   :Bound      波特率
//*返回值 :无
//*作者   :
//*****************************************************************************/

void RS485_Init(u16 Baud)
{
    Usart3_Module_Init(Baud);           // 初始化串口3
    GPIO_Init(RS485_PORT, RS485_EN_PIN, GPIO_Mode_Out_PP_High_Fast);            // 初始化接收发送使能端
    GPIO_Init(RS485_PWR_PORT, RS485_PWR_EN_PIN, GPIO_Mode_Out_PP_High_Fast);    // 初始化RS485电源使能脚
    RS485_PWR_ON();
    RS485_EN_RX();      // 默认接收
}
//*****************************************************************************/
//*函数名 :RS485_Send(u8 *Arr, u8 Len)
//*说明   :RS485发送数据
//*参数   :*Arr 需要发送的数组
//*        Len  数组的长度
//*返回值 :无
//*作者   :
//*****************************************************************************/

void RS485_Send(u8 *Arr, u8 Len)
{
    RS485_EN_TX();
    UsartSend(USART3, Arr, Len);
    RS485_EN_RX();
}